#include <iostream>
using namespace std;
/*************************************************************************************************

冒泡排序是O(n^2)级别的交换排序算法
排序要进行N轮，每一轮从尾部逐个向前扫描，遇到逆序对就进行交换。确保每一轮把最小的元素交换到前面去。
这个过程好比水中的气泡向上飘，所以叫冒泡排序。

*************************************************************************************************/
void BubbleSort(int a[], int n)
{
	for (int i = 0; i < n; ++i)
	{
		for (int j = n - 1; j > i; --j)
		{
			if (a[j - 1] > a[j])
			{
				int temp = a[j];
				a[j] = a[j - 1];
				a[j - 1] = temp;
			}
		}
	}
}
void main()
{
	int a[] = { 34,8,64,51,32,21 };
	BubbleSort(a, 6);
	for (int i = 0; i < 6; ++i)
	{
		cout << a[i] << " ";
	}
	cin.get();
}